In [1]:
import pandas as pd
import numpy as np

In [18]:
se1 = pd.Series([4,2,0,8], index=list('BDFC'))
se1

B    4
D    2
F    0
C    8
dtype: int64

In [6]:
# 값 정렬
se1.sort_values()

F    0
D    2
B    4
C    8
dtype: int64

In [10]:
# 오름차순
se1.sort_values(ascending=True)

F    0
D    2
B    4
C    8
dtype: int64

In [11]:
# 내림차순
se1.sort_values(ascending=False)

C    8
B    4
D    2
F    0
dtype: int64

In [19]:
se1

B    4
D    2
F    0
C    8
dtype: int64

In [22]:
se1.argsort()

B    2
D    1
F    0
C    3
dtype: int64

In [23]:
se1.idxmin()

'F'

In [24]:
se1.idxmax()

'C'

In [25]:
se2 = pd.Series([40,10,20,30], index=['c','a','b','d'])
se2

c    40
a    10
b    20
d    30
dtype: int64

In [26]:
se2.sort_index()

a    10
b    20
c    40
d    30
dtype: int64

In [27]:
se2.sort_index(ascending=False)

d    30
c    40
b    20
a    10
dtype: int64

In [29]:
df = pd.DataFrame([[2,4,6,8],[1,3,5,7]], index=['Even','Odd'], columns=['One','Two','Three','Four'])
df

      One  Two  Three  Four
Even    2    4      6     8
Odd     1    3      5     7

In [34]:
df.sort_values(by='Three')

      One  Two  Three  Four
Odd     1    3      5     7
Even    2    4      6     8

In [35]:
df.sort_values(by='Three', ascending=False)

      One  Two  Three  Four
Even    2    4      6     8
Odd     1    3      5     7

In [43]:
df2 = pd.DataFrame([[1.0, np.nan, 2.0, 3.0],[9.0, 4.0, 5.0, 6.0]], index=list('CA'), columns=list('dbac'))
df2

     d    b    a    c
C  1.0  NaN  2.0  3.0
A  9.0  4.0  5.0  6.0

In [46]:
df2.sort_values(by='b')

     d    b    a    c
A  9.0  4.0  5.0  6.0
C  1.0  NaN  2.0  3.0

In [47]:
df2.sort_values(by='b', na_position='last')

     d    b    a    c
A  9.0  4.0  5.0  6.0
C  1.0  NaN  2.0  3.0

In [49]:
df2.sort_values(by='b', na_position='first')

     d    b    a    c
C  1.0  NaN  2.0  3.0
A  9.0  4.0  5.0  6.0

In [50]:
df = pd.read_csv('../Pandas/People.csv')
df

               Date  In  Out
0    2020.2.12 0:00  10    3
1    2020.2.12 1:00   7    6
2    2020.2.12 2:00   8    2
3    2020.2.12 3:00   2    6
4    2020.2.12 4:00   4    3
5    2020.2.12 5:00   9    2
6    2020.2.12 6:00   1    1
7    2020.2.12 7:00   1    6
8    2020.2.12 8:00   2    3
9    2020.2.12 9:00   4    2
10  2020.2.12 10:00   5    6

In [51]:
df.sort_values(['In', 'Out'], ascending=['False','True'])

               Date  In  Out
6    2020.2.12 6:00   1    1
7    2020.2.12 7:00   1    6
8    2020.2.12 8:00   2    3
3    2020.2.12 3:00   2    6
9    2020.2.12 9:00   4    2
4    2020.2.12 4:00   4    3
10  2020.2.12 10:00   5    6
1    2020.2.12 1:00   7    6
2    2020.2.12 2:00   8    2
5    2020.2.12 5:00   9    2
0    2020.2.12 0:00  10    3

In [52]:
df2 = pd.DataFrame([{'A' : 2 , 'B' : 1, 'C': 4},
                   {'A': 6, 'B' : 0, 'C' : 7},
                   {'A' : 1, 'B' : 10, 'C' : 5}],
                  columns=['B','A','C'])

In [53]:
df2

    B  A  C
0   1  2  4
1   0  6  7
2  10  1  5

In [54]:
df2.sort_index(axis=1)

   A   B  C
0  2   1  4
1  6   0  7
2  1  10  5

In [55]:
df2 = pd.DataFrame([{'A' : 2 , 'B' : 1, 'C': 4},
                   {'A': 6, 'B' : 0, 'C' : 7},
                   {'A' : 1, 'B' : 10, 'C' : 5}], index=list('CAB'),
                  columns=['B','A','C'])

In [56]:
df2

    B  A  C
C   1  2  4
A   0  6  7
B  10  1  5

In [58]:
df2.sort_index()

    B  A  C
A   0  6  7
B  10  1  5
C   1  2  4

In [59]:
df2.sort_index().sort_index(axis=1)

   A   B  C
A  6   0  7
B  1  10  5
C  2   1  4

In [60]:
data = {'이름' : ['김소혜', '김도연', '최유정', '유연정', '강미나'],
       '학번' : [20200101, 20200102, 20200103, 20200104, 20200105],
       '점수' : [99, 94, 97, 91, 92]}

In [61]:
df3 = pd.DataFrame(data)

In [62]:
df3

    이름        학번  점수
0  김소혜  20200101  99
1  김도연  20200102  94
2  최유정  20200103  97
3  유연정  20200104  91
4  강미나  20200105  92

In [63]:
df3['점수'].rank(ascending=False)

0    1.0
1    3.0
2    2.0
3    5.0
4    4.0
Name: 점수, dtype: float64

In [65]:
df3['순위'] = df3['점수'].rank(ascending=False).astype('int64')

In [66]:
df3

    이름        학번  점수  순위
0  김소혜  20200101  99   1
1  김도연  20200102  94   3
2  최유정  20200103  97   2
3  유연정  20200104  91   5
4  강미나  20200105  92   4

In [67]:
df3.sort_values(by='순위')

    이름        학번  점수  순위
0  김소혜  20200101  99   1
2  최유정  20200103  97   2
1  김도연  20200102  94   3
4  강미나  20200105  92   4
3  유연정  20200104  91   5

In [68]:
df4 = df3.sort_values(by='순위')
df4.index = [0,1,2,3,4]
df4

    이름        학번  점수  순위
0  김소혜  20200101  99   1
1  최유정  20200103  97   2
2  김도연  20200102  94   3
3  강미나  20200105  92   4
4  유연정  20200104  91   5

In [69]:
data = {'A' : pd.Series([2.], index=['One']),
       'B' : pd.Series([2., 4.], index=['One','Two']),
       'C' : pd.Series([2., 4., 6., 8.], index = ['One', 'Two', 'Three', 'Four'])}

In [70]:
df = pd.DataFrame(data)

In [71]:
df

         A    B    C
Four   NaN  NaN  8.0
One    2.0  2.0  2.0
Three  NaN  NaN  6.0
Two    NaN  4.0  4.0